MikroElektronika/core_packages/PIC/XC8/def/PIC18LF8393/mcu.h
// Register: SPBRG2
#define SPBRG2 SPBRG2
extern volatile unsigned char           SPBRG2              __at(0xF6F);
#ifndef _LIB_BUILD
asm("SPBRG2 equ 0F6Fh");
#endif

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
extern volatile unsigned char           LCDDATA11           __at(0xF70);
#ifndef _LIB_BUILD
asm("LCDDATA11 equ 0F70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA11              :8;
    };
    struct {
        unsigned S40C1                  :1;
        unsigned S41C1                  :1;
        unsigned S42C1                  :1;
        unsigned S43C1                  :1;
        unsigned S44C1                  :1;
        unsigned S45C1                  :1;
        unsigned S46C1                  :1;
        unsigned S47C1                  :1;
    };
    struct {
        unsigned SEG40COM1              :1;
        unsigned SEG41COM1              :1;
        unsigned SEG42COM1              :1;
        unsigned SEG43COM1              :1;
        unsigned SEG44COM1              :1;
        unsigned SEG45COM1              :1;
        unsigned SEG46COM1              :1;
        unsigned SEG47COM1              :1;
    };
    struct {
        unsigned                        :1;
        unsigned ADMSK1                 :1;
        unsigned ADMSK2                 :1;
        unsigned ADMSK3                 :1;
        unsigned ADMSK4                 :1;
        unsigned ADMSK5                 :1;
    };
} LCDDATA11bits_t;
extern volatile LCDDATA11bits_t LCDDATA11bits __at(0xF70);
// bitfield macros
#define _LCDDATA11_LCDDATA11_POSN                           0x0
#define _LCDDATA11_LCDDATA11_POSITION                       0x0
#define _LCDDATA11_LCDDATA11_SIZE                           0x8
#define _LCDDATA11_LCDDATA11_LENGTH                         0x8
#define _LCDDATA11_LCDDATA11_MASK                           0xFF
#define _LCDDATA11_S40C1_POSN                               0x0
#define _LCDDATA11_S40C1_POSITION                           0x0
#define _LCDDATA11_S40C1_SIZE                               0x1
#define _LCDDATA11_S40C1_LENGTH                             0x1
#define _LCDDATA11_S40C1_MASK                               0x1
#define _LCDDATA11_S41C1_POSN                               0x1
#define _LCDDATA11_S41C1_POSITION                           0x1
#define _LCDDATA11_S41C1_SIZE                               0x1
#define _LCDDATA11_S41C1_LENGTH                             0x1
#define _LCDDATA11_S41C1_MASK                               0x2
#define _LCDDATA11_S42C1_POSN                               0x2
#define _LCDDATA11_S42C1_POSITION                           0x2
#define _LCDDATA11_S42C1_SIZE                               0x1
#define _LCDDATA11_S42C1_LENGTH                             0x1
#define _LCDDATA11_S42C1_MASK                               0x4
#define _LCDDATA11_S43C1_POSN                               0x3
#define _LCDDATA11_S43C1_POSITION                           0x3
#define _LCDDATA11_S43C1_SIZE                               0x1
#define _LCDDATA11_S43C1_LENGTH                             0x1
#define _LCDDATA11_S43C1_MASK                               0x8
#define _LCDDATA11_S44C1_POSN                               0x4
#define _LCDDATA11_S44C1_POSITION                           0x4
#define _LCDDATA11_S44C1_SIZE                               0x1
#define _LCDDATA11_S44C1_LENGTH                             0x1
#define _LCDDATA11_S44C1_MASK                               0x10
#define _LCDDATA11_S45C1_POSN                               0x5
#define _LCDDATA11_S45C1_POSITION                           0x5
#define _LCDDATA11_S45C1_SIZE                               0x1
#define _LCDDATA11_S45C1_LENGTH                             0x1
#define _LCDDATA11_S45C1_MASK                               0x20
#define _LCDDATA11_S46C1_POSN                               0x6
#define _LCDDATA11_S46C1_POSITION                           0x6
#define _LCDDATA11_S46C1_SIZE                               0x1
#define _LCDDATA11_S46C1_LENGTH                             0x1
#define _LCDDATA11_S46C1_MASK                               0x40
#define _LCDDATA11_S47C1_POSN                               0x7
#define _LCDDATA11_S47C1_POSITION                           0x7
#define _LCDDATA11_S47C1_SIZE                               0x1
#define _LCDDATA11_S47C1_LENGTH                             0x1
#define _LCDDATA11_S47C1_MASK                               0x80
#define _LCDDATA11_SEG40COM1_POSN                           0x0
#define _LCDDATA11_SEG40COM1_POSITION                       0x0
#define _LCDDATA11_SEG40COM1_SIZE                           0x1
#define _LCDDATA11_SEG40COM1_LENGTH                         0x1
#define _LCDDATA11_SEG40COM1_MASK                           0x1
#define _LCDDATA11_SEG41COM1_POSN                           0x1
#define _LCDDATA11_SEG41COM1_POSITION                       0x1
#define _LCDDATA11_SEG41COM1_SIZE                           0x1
#define _LCDDATA11_SEG41COM1_LENGTH                         0x1
#define _LCDDATA11_SEG41COM1_MASK                           0x2
#define _LCDDATA11_SEG42COM1_POSN                           0x2
#define _LCDDATA11_SEG42COM1_POSITION                       0x2
#define _LCDDATA11_SEG42COM1_SIZE                           0x1
#define _LCDDATA11_SEG42COM1_LENGTH                         0x1
#define _LCDDATA11_SEG42COM1_MASK                           0x4
#define _LCDDATA11_SEG43COM1_POSN                           0x3
#define _LCDDATA11_SEG43COM1_POSITION                       0x3
#define _LCDDATA11_SEG43COM1_SIZE                           0x1
#define _LCDDATA11_SEG43COM1_LENGTH                         0x1
#define _LCDDATA11_SEG43COM1_MASK                           0x8
#define _LCDDATA11_SEG44COM1_POSN                           0x4
#define _LCDDATA11_SEG44COM1_POSITION                       0x4
#define _LCDDATA11_SEG44COM1_SIZE                           0x1
#define _LCDDATA11_SEG44COM1_LENGTH                         0x1
#define _LCDDATA11_SEG44COM1_MASK                           0x10
#define _LCDDATA11_SEG45COM1_POSN                           0x5
#define _LCDDATA11_SEG45COM1_POSITION                       0x5
#define _LCDDATA11_SEG45COM1_SIZE                           0x1
#define _LCDDATA11_SEG45COM1_LENGTH                         0x1
#define _LCDDATA11_SEG45COM1_MASK                           0x20
#define _LCDDATA11_SEG46COM1_POSN                           0x6
#define _LCDDATA11_SEG46COM1_POSITION                       0x6
#define _LCDDATA11_SEG46COM1_SIZE                           0x1
#define _LCDDATA11_SEG46COM1_LENGTH                         0x1
#define _LCDDATA11_SEG46COM1_MASK                           0x40
#define _LCDDATA11_SEG47COM1_POSN                           0x7
#define _LCDDATA11_SEG47COM1_POSITION                       0x7
#define _LCDDATA11_SEG47COM1_SIZE                           0x1
#define _LCDDATA11_SEG47COM1_LENGTH                         0x1
#define _LCDDATA11_SEG47COM1_MASK                           0x80
#define _LCDDATA11_ADMSK1_POSN                              0x1
#define _LCDDATA11_ADMSK1_POSITION                          0x1
#define _LCDDATA11_ADMSK1_SIZE                              0x1
#define _LCDDATA11_ADMSK1_LENGTH                            0x1
#define _LCDDATA11_ADMSK1_MASK                              0x2
#define _LCDDATA11_ADMSK2_POSN                              0x2
#define _LCDDATA11_ADMSK2_POSITION                          0x2
#define _LCDDATA11_ADMSK2_SIZE                              0x1
#define _LCDDATA11_ADMSK2_LENGTH                            0x1
#define _LCDDATA11_ADMSK2_MASK                              0x4
#define _LCDDATA11_ADMSK3_POSN                              0x3
#define _LCDDATA11_ADMSK3_POSITION                          0x3
#define _LCDDATA11_ADMSK3_SIZE                              0x1
#define _LCDDATA11_ADMSK3_LENGTH                            0x1
#define _LCDDATA11_ADMSK3_MASK                              0x8
#define _LCDDATA11_ADMSK4_POSN                              0x4
#define _LCDDATA11_ADMSK4_POSITION                          0x4
#define _LCDDATA11_ADMSK4_SIZE                              0x1
#define _LCDDATA11_ADMSK4_LENGTH                            0x1
#define _LCDDATA11_ADMSK4_MASK                              0x10
#define _LCDDATA11_ADMSK5_POSN                              0x5
#define _LCDDATA11_ADMSK5_POSITION                          0x5
#define _LCDDATA11_ADMSK5_SIZE                              0x1
#define _LCDDATA11_ADMSK5_LENGTH                            0x1
#define _LCDDATA11_ADMSK5_MASK                              0x20

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
extern volatile unsigned char           LCDDATA12           __at(0xF71);
#ifndef _LIB_BUILD
asm("LCDDATA12 equ 0F71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA12              :8;
    };
    struct {
        unsigned S0C2                   :1;
        unsigned S1C2                   :1;
        unsigned S2C2                   :1;
        unsigned S3C2                   :1;
        unsigned S4C2                   :1;
        unsigned S5C2                   :1;
        unsigned S6C2                   :1;
        unsigned S7C2                   :1;
    };
    struct {
        unsigned SEG0COM2               :1;
        unsigned SEG1COM2               :1;
        unsigned SEG2COM2               :1;
        unsigned SEG3COM2               :1;
        unsigned SEG4COM2               :1;
        unsigned SEG5COM2               :1;
        unsigned SEG6COM2               :1;
        unsigned SEG7COM2               :1;
    };
    struct {
        unsigned S00C2                  :1;
        unsigned S01C2                  :1;
        unsigned S02C2                  :1;
        unsigned S03C2                  :1;
        unsigned S04C2                  :1;
        unsigned S05C2                  :1;
        unsigned S06C2                  :1;
        unsigned S07C2                  :1;
    };
    struct {
        unsigned SSPM012                :1;
        unsigned SSPM112                :1;
        unsigned SSPM212                :1;
        unsigned SSPM312                :1;
    };
} LCDDATA12bits_t;
