MikroElektronika/core_packages/PIC/XC8/def/PIC18LF8393/mcu.h
// Register: LCDDATA17
#define LCDDATA17 LCDDATA17
extern volatile unsigned char           LCDDATA17           __at(0xF76);
#ifndef _LIB_BUILD
asm("LCDDATA17 equ 0F76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA17              :8;
    };
    struct {
        unsigned S40C2                  :1;
        unsigned S41C2                  :1;
        unsigned S42C2                  :1;
        unsigned S43C2                  :1;
        unsigned S44C2                  :1;
        unsigned S45C2                  :1;
        unsigned S46C2                  :1;
        unsigned S47C2                  :1;
    };
    struct {
        unsigned SEG40COM2              :1;
        unsigned SEG41COM2              :1;
        unsigned SEG42COM2              :1;
        unsigned SEG43COM2              :1;
        unsigned SEG44COM2              :1;
        unsigned SEG45COM2              :1;
        unsigned SEG46COM2              :1;
        unsigned SEG47COM2              :1;
    };
} LCDDATA17bits_t;
extern volatile LCDDATA17bits_t LCDDATA17bits __at(0xF76);
// bitfield macros
#define _LCDDATA17_LCDDATA17_POSN                           0x0
#define _LCDDATA17_LCDDATA17_POSITION                       0x0
#define _LCDDATA17_LCDDATA17_SIZE                           0x8
#define _LCDDATA17_LCDDATA17_LENGTH                         0x8
#define _LCDDATA17_LCDDATA17_MASK                           0xFF
#define _LCDDATA17_S40C2_POSN                               0x0
#define _LCDDATA17_S40C2_POSITION                           0x0
#define _LCDDATA17_S40C2_SIZE                               0x1
#define _LCDDATA17_S40C2_LENGTH                             0x1
#define _LCDDATA17_S40C2_MASK                               0x1
#define _LCDDATA17_S41C2_POSN                               0x1
#define _LCDDATA17_S41C2_POSITION                           0x1
#define _LCDDATA17_S41C2_SIZE                               0x1
#define _LCDDATA17_S41C2_LENGTH                             0x1
#define _LCDDATA17_S41C2_MASK                               0x2
#define _LCDDATA17_S42C2_POSN                               0x2
#define _LCDDATA17_S42C2_POSITION                           0x2
#define _LCDDATA17_S42C2_SIZE                               0x1
#define _LCDDATA17_S42C2_LENGTH                             0x1
#define _LCDDATA17_S42C2_MASK                               0x4
#define _LCDDATA17_S43C2_POSN                               0x3
#define _LCDDATA17_S43C2_POSITION                           0x3
#define _LCDDATA17_S43C2_SIZE                               0x1
#define _LCDDATA17_S43C2_LENGTH                             0x1
#define _LCDDATA17_S43C2_MASK                               0x8
#define _LCDDATA17_S44C2_POSN                               0x4
#define _LCDDATA17_S44C2_POSITION                           0x4
#define _LCDDATA17_S44C2_SIZE                               0x1
#define _LCDDATA17_S44C2_LENGTH                             0x1
#define _LCDDATA17_S44C2_MASK                               0x10
#define _LCDDATA17_S45C2_POSN                               0x5
#define _LCDDATA17_S45C2_POSITION                           0x5
#define _LCDDATA17_S45C2_SIZE                               0x1
#define _LCDDATA17_S45C2_LENGTH                             0x1
#define _LCDDATA17_S45C2_MASK                               0x20
#define _LCDDATA17_S46C2_POSN                               0x6
#define _LCDDATA17_S46C2_POSITION                           0x6
#define _LCDDATA17_S46C2_SIZE                               0x1
#define _LCDDATA17_S46C2_LENGTH                             0x1
#define _LCDDATA17_S46C2_MASK                               0x40
#define _LCDDATA17_S47C2_POSN                               0x7
#define _LCDDATA17_S47C2_POSITION                           0x7
#define _LCDDATA17_S47C2_SIZE                               0x1
#define _LCDDATA17_S47C2_LENGTH                             0x1
#define _LCDDATA17_S47C2_MASK                               0x80
#define _LCDDATA17_SEG40COM2_POSN                           0x0
#define _LCDDATA17_SEG40COM2_POSITION                       0x0
#define _LCDDATA17_SEG40COM2_SIZE                           0x1
#define _LCDDATA17_SEG40COM2_LENGTH                         0x1
#define _LCDDATA17_SEG40COM2_MASK                           0x1
#define _LCDDATA17_SEG41COM2_POSN                           0x1
#define _LCDDATA17_SEG41COM2_POSITION                       0x1
#define _LCDDATA17_SEG41COM2_SIZE                           0x1
#define _LCDDATA17_SEG41COM2_LENGTH                         0x1
#define _LCDDATA17_SEG41COM2_MASK                           0x2
#define _LCDDATA17_SEG42COM2_POSN                           0x2
#define _LCDDATA17_SEG42COM2_POSITION                       0x2
#define _LCDDATA17_SEG42COM2_SIZE                           0x1
#define _LCDDATA17_SEG42COM2_LENGTH                         0x1
#define _LCDDATA17_SEG42COM2_MASK                           0x4
#define _LCDDATA17_SEG43COM2_POSN                           0x3
#define _LCDDATA17_SEG43COM2_POSITION                       0x3
#define _LCDDATA17_SEG43COM2_SIZE                           0x1
#define _LCDDATA17_SEG43COM2_LENGTH                         0x1
#define _LCDDATA17_SEG43COM2_MASK                           0x8
#define _LCDDATA17_SEG44COM2_POSN                           0x4
#define _LCDDATA17_SEG44COM2_POSITION                       0x4
#define _LCDDATA17_SEG44COM2_SIZE                           0x1
#define _LCDDATA17_SEG44COM2_LENGTH                         0x1
#define _LCDDATA17_SEG44COM2_MASK                           0x10
#define _LCDDATA17_SEG45COM2_POSN                           0x5
#define _LCDDATA17_SEG45COM2_POSITION                       0x5
#define _LCDDATA17_SEG45COM2_SIZE                           0x1
#define _LCDDATA17_SEG45COM2_LENGTH                         0x1
#define _LCDDATA17_SEG45COM2_MASK                           0x20
#define _LCDDATA17_SEG46COM2_POSN                           0x6
#define _LCDDATA17_SEG46COM2_POSITION                       0x6
#define _LCDDATA17_SEG46COM2_SIZE                           0x1
#define _LCDDATA17_SEG46COM2_LENGTH                         0x1
#define _LCDDATA17_SEG46COM2_MASK                           0x40
#define _LCDDATA17_SEG47COM2_POSN                           0x7
#define _LCDDATA17_SEG47COM2_POSITION                       0x7
#define _LCDDATA17_SEG47COM2_SIZE                           0x1
#define _LCDDATA17_SEG47COM2_LENGTH                         0x1
#define _LCDDATA17_SEG47COM2_MASK                           0x80

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
extern volatile unsigned char           LCDDATA18           __at(0xF77);
#ifndef _LIB_BUILD
asm("LCDDATA18 equ 0F77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA18              :8;
    };
    struct {
        unsigned S0C3                   :1;
        unsigned S1C3                   :1;
        unsigned S2C3                   :1;
        unsigned S3C3                   :1;
        unsigned S4C3                   :1;
        unsigned S5C3                   :1;
        unsigned S6C3                   :1;
        unsigned S7C3                   :1;
    };
    struct {
        unsigned SEG0COM3               :1;
        unsigned SEG1COM3               :1;
        unsigned SEG2COM3               :1;
        unsigned SEG3COM3               :1;
        unsigned SEG4COM3               :1;
        unsigned SEG5COM3               :1;
        unsigned SEG6COM3               :1;
        unsigned SEG7COM3               :1;
    };
    struct {
        unsigned S00C3                  :1;
        unsigned S01C3                  :1;
        unsigned S02C3                  :1;
        unsigned S03C3                  :1;
        unsigned S04C3                  :1;
        unsigned S05C3                  :1;
        unsigned S06C3                  :1;
        unsigned S07C3                  :1;
    };
} LCDDATA18bits_t;
