MikroElektronika/core_packages/PIC/XC8/def/PIC18LF8393/mcu.h
#define                                 SEG40COM0_bit       _BIT_ACCESS(LCDDATA5,0)
// LCDDATA11<SEG40COM1>
extern volatile __bit                   SEG40COM1           __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 SEG40COM1_bit       _BIT_ACCESS(LCDDATA11,0)
// LCDDATA17<SEG40COM2>
extern volatile __bit                   SEG40COM2           __at(0x7BB0);	// @ (0xF76 * 8 + 0)
#define                                 SEG40COM2_bit       _BIT_ACCESS(LCDDATA17,0)
// LCDDATA23<SEG40COM3>
extern volatile __bit                   SEG40COM3           __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 SEG40COM3_bit       _BIT_ACCESS(LCDDATA23,0)
// PORTH<SEG41>
extern volatile __bit                   SEG41               __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 SEG41_bit           _BIT_ACCESS(PORTH,5)
// LCDDATA5<SEG41COM0>
extern volatile __bit                   SEG41COM0           __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 SEG41COM0_bit       _BIT_ACCESS(LCDDATA5,1)
// LCDDATA11<SEG41COM1>
extern volatile __bit                   SEG41COM1           __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 SEG41COM1_bit       _BIT_ACCESS(LCDDATA11,1)
// LCDDATA17<SEG41COM2>
extern volatile __bit                   SEG41COM2           __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 SEG41COM2_bit       _BIT_ACCESS(LCDDATA17,1)
// LCDDATA23<SEG41COM3>
extern volatile __bit                   SEG41COM3           __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 SEG41COM3_bit       _BIT_ACCESS(LCDDATA23,1)
// PORTH<SEG42>
extern volatile __bit                   SEG42               __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 SEG42_bit           _BIT_ACCESS(PORTH,6)
// LCDDATA5<SEG42COM0>
extern volatile __bit                   SEG42COM0           __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 SEG42COM0_bit       _BIT_ACCESS(LCDDATA5,2)
// LCDDATA11<SEG42COM1>
extern volatile __bit                   SEG42COM1           __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 SEG42COM1_bit       _BIT_ACCESS(LCDDATA11,2)
// LCDDATA17<SEG42COM2>
extern volatile __bit                   SEG42COM2           __at(0x7BB2);	// @ (0xF76 * 8 + 2)
#define                                 SEG42COM2_bit       _BIT_ACCESS(LCDDATA17,2)
// LCDDATA23<SEG42COM3>
extern volatile __bit                   SEG42COM3           __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 SEG42COM3_bit       _BIT_ACCESS(LCDDATA23,2)
// PORTH<SEG43>
extern volatile __bit                   SEG43               __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 SEG43_bit           _BIT_ACCESS(PORTH,7)
// LCDDATA5<SEG43COM0>
extern volatile __bit                   SEG43COM0           __at(0x7B2B);	// @ (0xF65 * 8 + 3)
#define                                 SEG43COM0_bit       _BIT_ACCESS(LCDDATA5,3)
// LCDDATA11<SEG43COM1>
extern volatile __bit                   SEG43COM1           __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 SEG43COM1_bit       _BIT_ACCESS(LCDDATA11,3)
// LCDDATA17<SEG43COM2>
extern volatile __bit                   SEG43COM2           __at(0x7BB3);	// @ (0xF76 * 8 + 3)
#define                                 SEG43COM2_bit       _BIT_ACCESS(LCDDATA17,3)
// LCDDATA23<SEG43COM3>
extern volatile __bit                   SEG43COM3           __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 SEG43COM3_bit       _BIT_ACCESS(LCDDATA23,3)
// PORTH<SEG44>
extern volatile __bit                   SEG44               __at(0x7C3B);	// @ (0xF87 * 8 + 3)
#define                                 SEG44_bit           _BIT_ACCESS(PORTH,3)
// LCDDATA5<SEG44COM0>
extern volatile __bit                   SEG44COM0           __at(0x7B2C);	// @ (0xF65 * 8 + 4)
#define                                 SEG44COM0_bit       _BIT_ACCESS(LCDDATA5,4)
// LCDDATA11<SEG44COM1>
extern volatile __bit                   SEG44COM1           __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 SEG44COM1_bit       _BIT_ACCESS(LCDDATA11,4)
// LCDDATA17<SEG44COM2>
extern volatile __bit                   SEG44COM2           __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 SEG44COM2_bit       _BIT_ACCESS(LCDDATA17,4)
// LCDDATA23<SEG44COM3>
extern volatile __bit                   SEG44COM3           __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 SEG44COM3_bit       _BIT_ACCESS(LCDDATA23,4)
// PORTH<SEG45>
extern volatile __bit                   SEG45               __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 SEG45_bit           _BIT_ACCESS(PORTH,2)
// LCDDATA5<SEG45COM0>
extern volatile __bit                   SEG45COM0           __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 SEG45COM0_bit       _BIT_ACCESS(LCDDATA5,5)
// LCDDATA11<SEG45COM1>
extern volatile __bit                   SEG45COM1           __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 SEG45COM1_bit       _BIT_ACCESS(LCDDATA11,5)
// LCDDATA17<SEG45COM2>
extern volatile __bit                   SEG45COM2           __at(0x7BB5);	// @ (0xF76 * 8 + 5)
#define                                 SEG45COM2_bit       _BIT_ACCESS(LCDDATA17,5)
// LCDDATA23<SEG45COM3>
extern volatile __bit                   SEG45COM3           __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 SEG45COM3_bit       _BIT_ACCESS(LCDDATA23,5)
// PORTH<SEG46>
extern volatile __bit                   SEG46               __at(0x7C39);	// @ (0xF87 * 8 + 1)
#define                                 SEG46_bit           _BIT_ACCESS(PORTH,1)
// LCDDATA5<SEG46COM0>
extern volatile __bit                   SEG46COM0           __at(0x7B2E);	// @ (0xF65 * 8 + 6)
#define                                 SEG46COM0_bit       _BIT_ACCESS(LCDDATA5,6)
// LCDDATA11<SEG46COM1>
extern volatile __bit                   SEG46COM1           __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 SEG46COM1_bit       _BIT_ACCESS(LCDDATA11,6)
// LCDDATA17<SEG46COM2>
extern volatile __bit                   SEG46COM2           __at(0x7BB6);	// @ (0xF76 * 8 + 6)
#define                                 SEG46COM2_bit       _BIT_ACCESS(LCDDATA17,6)
// LCDDATA23<SEG46COM3>
extern volatile __bit                   SEG46COM3           __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 SEG46COM3_bit       _BIT_ACCESS(LCDDATA23,6)
// PORTH<SEG47>
extern volatile __bit                   SEG47               __at(0x7C38);	// @ (0xF87 * 8 + 0)
#define                                 SEG47_bit           _BIT_ACCESS(PORTH,0)
// LCDDATA5<SEG47COM0>
extern volatile __bit                   SEG47COM0           __at(0x7B2F);	// @ (0xF65 * 8 + 7)
#define                                 SEG47COM0_bit       _BIT_ACCESS(LCDDATA5,7)
// LCDDATA11<SEG47COM1>
extern volatile __bit                   SEG47COM1           __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 SEG47COM1_bit       _BIT_ACCESS(LCDDATA11,7)
// LCDDATA17<SEG47COM2>
extern volatile __bit                   SEG47COM2           __at(0x7BB7);	// @ (0xF76 * 8 + 7)
#define                                 SEG47COM2_bit       _BIT_ACCESS(LCDDATA17,7)
// LCDDATA23<SEG47COM3>
extern volatile __bit                   SEG47COM3           __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 SEG47COM3_bit       _BIT_ACCESS(LCDDATA23,7)
// LCDDATA0<SEG4COM0>
extern volatile __bit                   SEG4COM0            __at(0x7B04);	// @ (0xF60 * 8 + 4)
#define                                 SEG4COM0_bit        _BIT_ACCESS(LCDDATA0,4)
// LCDDATA6<SEG4COM1>
extern volatile __bit                   SEG4COM1            __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 SEG4COM1_bit        _BIT_ACCESS(LCDDATA6,4)
// LCDDATA12<SEG4COM2>
extern volatile __bit                   SEG4COM2            __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 SEG4COM2_bit        _BIT_ACCESS(LCDDATA12,4)
// LCDDATA18<SEG4COM3>
extern volatile __bit                   SEG4COM3            __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 SEG4COM3_bit        _BIT_ACCESS(LCDDATA18,4)
// PORTD<SEG5>
extern volatile __bit                   SEG5                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 SEG5_bit            _BIT_ACCESS(PORTD,5)
// LCDDATA0<SEG5COM0>
extern volatile __bit                   SEG5COM0            __at(0x7B05);	// @ (0xF60 * 8 + 5)
#define                                 SEG5COM0_bit        _BIT_ACCESS(LCDDATA0,5)
// LCDDATA6<SEG5COM1>
extern volatile __bit                   SEG5COM1            __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 SEG5COM1_bit        _BIT_ACCESS(LCDDATA6,5)
// LCDDATA12<SEG5COM2>
extern volatile __bit                   SEG5COM2            __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 SEG5COM2_bit        _BIT_ACCESS(LCDDATA12,5)
// LCDDATA18<SEG5COM3>
extern volatile __bit                   SEG5COM3            __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 SEG5COM3_bit        _BIT_ACCESS(LCDDATA18,5)
// PORTD<SEG6>
extern volatile __bit                   SEG6                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 SEG6_bit            _BIT_ACCESS(PORTD,6)
// LCDDATA0<SEG6COM0>
extern volatile __bit                   SEG6COM0            __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 SEG6COM0_bit        _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<SEG6COM1>
extern volatile __bit                   SEG6COM1            __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 SEG6COM1_bit        _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<SEG6COM2>
extern volatile __bit                   SEG6COM2            __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 SEG6COM2_bit        _BIT_ACCESS(LCDDATA12,6)
// LCDDATA18<SEG6COM3>
extern volatile __bit                   SEG6COM3            __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 SEG6COM3_bit        _BIT_ACCESS(LCDDATA18,6)
// PORTD<SEG7>
extern volatile __bit                   SEG7                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SEG7_bit            _BIT_ACCESS(PORTD,7)
// LCDDATA0<SEG7COM0>
extern volatile __bit                   SEG7COM0            __at(0x7B07);	// @ (0xF60 * 8 + 7)
#define                                 SEG7COM0_bit        _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<SEG7COM1>
extern volatile __bit                   SEG7COM1            __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 SEG7COM1_bit        _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<SEG7COM2>
extern volatile __bit                   SEG7COM2            __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 SEG7COM2_bit        _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<SEG7COM3>
extern volatile __bit                   SEG7COM3            __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 SEG7COM3_bit        _BIT_ACCESS(LCDDATA18,7)
// PORTB<SEG8>
extern volatile __bit                   SEG8                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 SEG8_bit            _BIT_ACCESS(PORTB,1)
// LCDDATA1<SEG8COM0>
extern volatile __bit                   SEG8COM0            __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 SEG8COM0_bit        _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<SEG8COM1>
extern volatile __bit                   SEG8COM1            __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 SEG8COM1_bit        _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<SEG8COM2>
extern volatile __bit                   SEG8COM2            __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 SEG8COM2_bit        _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<SEG8COM3>
extern volatile __bit                   SEG8COM3            __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 SEG8COM3_bit        _BIT_ACCESS(LCDDATA19,0)
// PORTB<SEG9>
extern volatile __bit                   SEG9                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 SEG9_bit            _BIT_ACCESS(PORTB,2)
// LCDDATA1<SEG9COM0>
extern volatile __bit                   SEG9COM0            __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 SEG9COM0_bit        _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<SEG9COM1>
extern volatile __bit                   SEG9COM1            __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 SEG9COM1_bit        _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<SEG9COM2>
extern volatile __bit                   SEG9COM2            __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 SEG9COM2_bit        _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<SEG9COM3>
extern volatile __bit                   SEG9COM3            __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 SEG9COM3_bit        _BIT_ACCESS(LCDDATA19,1)
// LCDSE0<SEGEN0>
extern volatile __bit                   SEGEN0              __at(0x7AD0);	// @ (0xF5A * 8 + 0)
#define                                 SEGEN0_bit          _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SEGEN1>
extern volatile __bit                   SEGEN1              __at(0x7AD1);	// @ (0xF5A * 8 + 1)
#define                                 SEGEN1_bit          _BIT_ACCESS(LCDSE0,1)
// LCDSE1<SEGEN10>
extern volatile __bit                   SEGEN10             __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 SEGEN10_bit         _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SEGEN11>
extern volatile __bit                   SEGEN11             __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 SEGEN11_bit         _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SEGEN12>
extern volatile __bit                   SEGEN12             __at(0x7ADC);	// @ (0xF5B * 8 + 4)
#define                                 SEGEN12_bit         _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SEGEN13>
extern volatile __bit                   SEGEN13             __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 SEGEN13_bit         _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SEGEN14>
extern volatile __bit                   SEGEN14             __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 SEGEN14_bit         _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SEGEN15>
extern volatile __bit                   SEGEN15             __at(0x7ADF);	// @ (0xF5B * 8 + 7)
#define                                 SEGEN15_bit         _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SEGEN16>
extern volatile __bit                   SEGEN16             __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 SEGEN16_bit         _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SEGEN17>
extern volatile __bit                   SEGEN17             __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 SEGEN17_bit         _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SEGEN18>
extern volatile __bit                   SEGEN18             __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 SEGEN18_bit         _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SEGEN19>
extern volatile __bit                   SEGEN19             __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 SEGEN19_bit         _BIT_ACCESS(LCDSE2,3)
// LCDSE0<SEGEN2>
extern volatile __bit                   SEGEN2              __at(0x7AD2);	// @ (0xF5A * 8 + 2)
#define                                 SEGEN2_bit          _BIT_ACCESS(LCDSE0,2)
// LCDSE2<SEGEN20>
extern volatile __bit                   SEGEN20             __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 SEGEN20_bit         _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SEGEN21>
extern volatile __bit                   SEGEN21             __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 SEGEN21_bit         _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SEGEN22>
extern volatile __bit                   SEGEN22             __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 SEGEN22_bit         _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SEGEN23>
extern volatile __bit                   SEGEN23             __at(0x7AE7);	// @ (0xF5C * 8 + 7)
#define                                 SEGEN23_bit         _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SEGEN24>
extern volatile __bit                   SEGEN24             __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 SEGEN24_bit         _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SEGEN25>
extern volatile __bit                   SEGEN25             __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 SEGEN25_bit         _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SEGEN26>
extern volatile __bit                   SEGEN26             __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 SEGEN26_bit         _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SEGEN27>
extern volatile __bit                   SEGEN27             __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 SEGEN27_bit         _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SEGEN28>
extern volatile __bit                   SEGEN28             __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 SEGEN28_bit         _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SEGEN29>
extern volatile __bit                   SEGEN29             __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 SEGEN29_bit         _BIT_ACCESS(LCDSE3,5)
// LCDSE0<SEGEN3>
extern volatile __bit                   SEGEN3              __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 SEGEN3_bit          _BIT_ACCESS(LCDSE0,3)
// LCDSE3<SEGEN30>
extern volatile __bit                   SEGEN30             __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 SEGEN30_bit         _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SEGEN31>
extern volatile __bit                   SEGEN31             __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 SEGEN31_bit         _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SEGEN32>
extern volatile __bit                   SEGEN32             __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 SEGEN32_bit         _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SEGEN33>
extern volatile __bit                   SEGEN33             __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 SEGEN33_bit         _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SEGEN34>
extern volatile __bit                   SEGEN34             __at(0x7AF2);	// @ (0xF5E * 8 + 2)
#define                                 SEGEN34_bit         _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SEGEN35>
extern volatile __bit                   SEGEN35             __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 SEGEN35_bit         _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SEGEN36>
extern volatile __bit                   SEGEN36             __at(0x7AF4);	// @ (0xF5E * 8 + 4)
#define                                 SEGEN36_bit         _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SEGEN37>
extern volatile __bit                   SEGEN37             __at(0x7AF5);	// @ (0xF5E * 8 + 5)
#define                                 SEGEN37_bit         _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SEGEN38>
extern volatile __bit                   SEGEN38             __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 SEGEN38_bit         _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SEGEN39>
extern volatile __bit                   SEGEN39             __at(0x7AF7);	// @ (0xF5E * 8 + 7)
#define                                 SEGEN39_bit         _BIT_ACCESS(LCDSE4,7)
// LCDSE0<SEGEN4>
extern volatile __bit                   SEGEN4              __at(0x7AD4);	// @ (0xF5A * 8 + 4)
#define                                 SEGEN4_bit          _BIT_ACCESS(LCDSE0,4)
// LCDSE5<SEGEN40>
extern volatile __bit                   SEGEN40             __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 SEGEN40_bit         _BIT_ACCESS(LCDSE5,0)
// LCDSE5<SEGEN41>
extern volatile __bit                   SEGEN41             __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 SEGEN41_bit         _BIT_ACCESS(LCDSE5,1)
// LCDSE5<SEGEN42>
extern volatile __bit                   SEGEN42             __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 SEGEN42_bit         _BIT_ACCESS(LCDSE5,2)
// LCDSE5<SEGEN43>
extern volatile __bit                   SEGEN43             __at(0x7AFB);	// @ (0xF5F * 8 + 3)
#define                                 SEGEN43_bit         _BIT_ACCESS(LCDSE5,3)
// LCDSE5<SEGEN44>
extern volatile __bit                   SEGEN44             __at(0x7AFC);	// @ (0xF5F * 8 + 4)
#define                                 SEGEN44_bit         _BIT_ACCESS(LCDSE5,4)
// LCDSE5<SEGEN45>
extern volatile __bit                   SEGEN45             __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 SEGEN45_bit         _BIT_ACCESS(LCDSE5,5)
// LCDSE5<SEGEN46>
extern volatile __bit                   SEGEN46             __at(0x7AFE);	// @ (0xF5F * 8 + 6)
#define                                 SEGEN46_bit         _BIT_ACCESS(LCDSE5,6)
// LCDSE5<SEGEN47>
extern volatile __bit                   SEGEN47             __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 SEGEN47_bit         _BIT_ACCESS(LCDSE5,7)
// LCDSE0<SEGEN5>
extern volatile __bit                   SEGEN5              __at(0x7AD5);	// @ (0xF5A * 8 + 5)
#define                                 SEGEN5_bit          _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SEGEN6>
extern volatile __bit                   SEGEN6              __at(0x7AD6);	// @ (0xF5A * 8 + 6)
#define                                 SEGEN6_bit          _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SEGEN7>
extern volatile __bit                   SEGEN7              __at(0x7AD7);	// @ (0xF5A * 8 + 7)
#define                                 SEGEN7_bit          _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SEGEN8>
extern volatile __bit                   SEGEN8              __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 SEGEN8_bit          _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SEGEN9>
extern volatile __bit                   SEGEN9              __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 SEGEN9_bit          _BIT_ACCESS(LCDSE1,1)
// SSPCON2<SEN>
extern volatile __bit                   SEN                 __at(0x7E28);	// @ (0xFC5 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSPCON2,0)
// TXSTA1<SENDB>
extern volatile __bit                   SENDB               __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TXSTA1,3)
// TXSTA1<SENDB1>
extern volatile __bit                   SENDB1              __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB1_bit          _BIT_ACCESS(TXSTA1,3)
// TXSTA2<SENDB2>
extern volatile __bit                   SENDB2              __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 SENDB2_bit          _BIT_ACCESS(TXSTA2,3)
// LCDCON<SLPEN>
extern volatile __bit                   SLPEN               __at(0x7ACE);	// @ (0xF59 * 8 + 6)
#define                                 SLPEN_bit           _BIT_ACCESS(LCDCON,6)
// SSPSTAT<SMP>
